SDPExchange/bin/Debug/CardInfoRequest.xml

<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope xmlns:ser="http://umarsh.ru/sdp/servicepojo" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Header>
    <wsse:Security soapenv:mustUnderstand="0" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
      <wsse:UserNameToken xmlns:wsu="...">
        <wsse:UserName>adminnimda</wsse:UserName>
        <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">1q2w3e</wsse:Password>
      </wsse:UserNameToken>
    </wsse:Security>
  </soapenv:Header>
  <soapenv:Body>
    <ser:CardInfoRequest>
      <ser:agentId>1234</ser:agentId>
      <ser:salepointId>1</ser:salepointId>
      <ser:version>1</ser:version>
      <ser:sysNum>1254785879</ser:sysNum>
      <ser:regionId>65</ser:regionId>
      <ser:deviceID>1234</ser:deviceID>
    </ser:CardInfoRequest>
  </soapenv:Body>
</soapenv:Envelope>